bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
/*
      Tiny Robot Code, v0.7
      by Bill Weiler

      These are the current versions of the tools. As time goes by, I'll have to upgrade.
      Segger Embedded Studio - full version is free for Nordic chips, using ARM M version v3.34
      Segger J-Link EDU or Adafruit J-Link - this is a cheaper programmer for learning
      Nordic nRF5 SDK v14.2
      Nordic SDK BLE_Peripheral_Template and nRF Blinky example used as starting point 
      CMSIS DSP Library
      Nordic chip: nRF52832 QFN48 AA
      nRF52832 runs at 64Mhz, has 512k flash and 64k SRAM, and hardware single precision floating point
      Nordic BLE Stack is called Softdevice and only comes in hex form, I'm using S132 v5.0.0

      Targets for this code are Tiny Robot and the Sparkfun nRF52832 design I use for my test rigs.
      Tiny Robot has these features:
      1. ST VLX6180 distance sensor controlled through i2c
      2. 2 motors, left and right, driven through 2 TI DRV8834. The DRV's are driven by gpio's
      3. Microphone into microcontroller PDM peripheral that outputs PCM signed 16bit mono audio
      4. Buzzer out of microcontroller PWM1 peripheral
      5. 1 LED out from a gpio, active low (clearing it (setting it to 0) turns led on)
      6. BLE, the s132 softdevice supports central and peripheral, observer and broadcaster, total 20 connections (that's 19 robots and a cellphone!)

      There is no physical crystal LF oscillator in Tiny Robot, the softdevice uses the internal RC oscillator, 
      there is however, a physical 32Mhz crystal HF oscillator for the CPU

      Something to watch out for: the BLE s132 stack uses peripherals and needs scheduling. Notably it takes Timer0, 
      some flash and ram, and a lot of cpu cycles. If you have problems, use their API for scheduling time slots. 
      Check the Softdevice documentation for occasional blocking of peripherals.

      Motors are bi-polar stepping motors. The manufacturer says they don't like microstepping, but it seems fine. 
      Some specs are a step is 18 degrees, about 1.67mm of wheel travel. Microstepping is weirdly non-linear, so
      going from 1/4 to 1/8 just doubling steps doesn't result in the same speed.
      Minimum freq for full-step seems to be 200
      Maxmimum freq full-step for starting rotation is 800

      For true hardware floating point, GCC is not always smart enough, you can use idioms or intrinsics, 
      or just check disassembly to make sure FPU instructions were used.

      For understanding firmware to master it, read this stuff (it's a big amount):
      1. nRF52832 datasheet, watch out for old versions, like on Sparkfun, I am using v1.4
      2. Nordic Softdevice Specification
      3. Nordic Errata (skim, too boring)
      4. Nordic Softdevice API - online only
      5. Nordic devzone forums
      6. Nordic Compatability list (really boring but skim)
      7. ST VLX6180 datasheet (some tricks you can do)
      8. Knowles Microphone datasheet - The datasheet is minimally useful, it just has audio specs. I would read stuff 
         about PDM and PCM. You can download the audio to your PC and play it with Audacity (Audacity is free).
         Audacity gotcha is, the file extension must be .wav, not the .bin Segger IDE captures and writes by default.

      I tried to get faster uploading of the sound file by using larger BLE packets sizes. Cheap phones don't support larger
      sizes however, I went back to 20 bytes from trying 128 bytes.
      One arcane thing I did change for greater than 20byte transfers from the default project:
      I changed this line in ble_app_template_pca10040_s132.emProject
       
       before: RAM_START=0x200020e0;RAM_SIZE=0xdf20"
       after:  RAM_START=0x20002400;RAM_SIZE=0xdc00"

      This increased reserved ram from 0x20e0 to 0x2400. I increased NRF_SDH_BLE_GATT_MAX_MTU_SIZE from 23 to 128.
      I went back to and am using 23 for my Moto E4. If I set it to 128, My Moto E4 rejects the larger MTU request 
      and won't even connect.
      128 MTU plus a 20ms connection interval can transfer 32k in 5s
      23 MTU plus a 10ms connection interval takes 15s
*/
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include "sdk_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "app_timer.h"
#include "fds.h"
#include "peer_manager.h"
#include "ble_conn_state.h"
#include "nrf_ble_gatt.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "arm_const_structs.h"
#include "nrf_drv_twi.h"
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "nrf_pwm.h"
#include "nrf_timer.h"
#include "nrf_uarte.h"    
#include "vl6180.h"
#include "nrf_drv_pdm.h"

//COMMAND SET FOR BLE
#define MOTORS_RIGHT      0x10
#define MOTORS_LEFT       0x11
#define MOTORS_FORWARD    0x12
#define MOTORS_BACKWARD   0x13
#define MOTORS_STOP       0x14
#define STOP_TURNING      0x15
#define MOTORS_SLEEP      0x16
#define INC_STEP_MODE     0x19
//DEC not in Android yet
#define DEC_STEP_MODE     0x18
#define PLAY_BUZZER       0x17

#define GET_DISTANCE      0x22
#define GET_AMBIENT       0x21

#define RECORD_SOUND      0x30
#define RECORD_SOUND_PI   0x33
#define INCREASE_GAIN     0x31
#define DECREASE_GAIN     0x32

#define ROVER_MODE        0x40
#define ROVER_MODE_REV    0x42
#define FOTOV_MODE        0x41
/*
    Conditional compilation
    ========================================================
    MB_TEST = mainboard (also called FB) tester
    SPARKFUN 1 = Sparkfun reference used for testing daugtherboard (also called BB)
    SPARTFUN 0 = Tiny Robot firmware
    ADHOC_TEST = ad hoc test - targeted for debugging a specific thing
    MOTORS_STEPPING_PWM = enables PWM functions for use in stepping, you must disable gpio/timer1
*/
#define MB_TEST     0
#define MICROPHONE  0
#define SPARKFUN    0
#define ADHOC_TEST  0
#define MOTORS_STEPPING_PWM 0
#if MB_TEST
#define SPARKFUN 0
#endif

#if SPARKFUN

#define UART_RX_PIN   26
#define UART_TX_PIN   27
#define SLEEP         18
#define DIR_R         19
//actually red
#define GREEN_LED     7

#else

#define UART_RX_PIN   12
#define UART_TX_PIN   11
#define SLEEP         27
#define DIR_R         26
#define GREEN_LED     2

#endif

//Buzzer
#define BUZZER_10MM   8

//microphone
#define MIC_CLK       28
#define MIC_DI        29

//VLX6180
#define GP0           14
#define GP1           13
#define I2C0_SCL      15
#define I2C0_SDA      16

//motors
#define M1            25
#define M0            23
#define DIR_L         22
#define STEP          30

