bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
//Microphone, 16k is 1s of audio
#define SAMPLE_BUFFER_CNT 16*1024
int16_t p_rx_buffer[SAMPLE_BUFFER_CNT+6];    //+6 makes it 16,380/20=1638 20 byte packets
uint8_t mic_gain = NRF_PDM_GAIN_DEFAULT;
uint32_t load_buffer_offset = 0;
volatile bool m_xfer_done = false;
void configure_microphone(void);
void audio_handler(nrf_drv_pdm_evt_t const * const evt);                //Just sets xfer_done

//Distance sensor
#define TWI_INSTANCE_ID 0
uint16_t data2_value;
const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);
void configure_VLX6180(void);
void VLX6180_init(void);
void twi_init(void);
volatile ret_code_t vl6180_err_code;

//UART
uint8_t sendbuffer[64];
uint8_t recvbuffer[64];
void uart_init(void);
void sendbytes(uint8_t a);
void TxUART(uint8_t* buf);
static uint8_t teststr[2] = { 'A',0 };

//Motors
uint8_t timer1_enabled_for_motors = 0, step_loop_done = 0, turn_flag = 0, motor_state;
uint32_t timer1_counter, timer1_match_value, timer1_toggle_step, timer_turn_step_count, timer_turn_match;
void motors_forward();
void motors_backward(void);
void motors_right(void);
void motors_left(void);
void turn_left_90_degrees(void);
void pwm_motor_stepping(uint32_t steps_per_second, uint32_t number_steps);
void stop_stepping(void);
void stepping_mode(uint8_t mode);
void step_mode_experiment(void);
void motors_sleep(void);
void motors_wake(void);
void start_stepping_gpio(uint16_t freq);
void stop_stepping_gpio(void);

//Buzzer
uint8_t buzzer_loops_done = 1, song_playing = 0;
void pwm_buzzer_frequency(float freq, uint32_t loops);
void stop_buzzer(void);
//This song feature isn't done
struct notes_struct {
  float32_t freq;
  uint16_t duration;
};
struct song_struct {
  uint16_t num_notes; 
  struct notes_struct *notes;
} song;

//General
void my_configure(void);
void bb_test(void);
void adhoc_robot_test(void);
void mb_test(void);
void led_off(void);
void led_on(void);
void rover(uint32_t freq, uint8_t dirmode);        //does current step mode
static uint8_t range, buf[64], distance, callonce;
struct notes_struct basic[4] = { 440.0, 100, 470.0, 100, 2600.0, 200, 1000.0, 500 };

//Entry point of firmware
int main(void)
{
    uint8_t step_mode = n32_STEP, counter = 0, recording_flag=0, last_cmd=0;
    uint8_t photovore_mode=0, recording_flag_pi = 0;
    uint16_t lux_threshold;
    uint32_t freq = 1000, steps = 200, i, ms_cnt;
    float32_t ambient_value;
    ret_code_t err_code;
    song.num_notes = 3;
    song.notes = basic;
 
    nrf_gpio_cfg_output(GREEN_LED);
    led_off();
    my_configure();           //sets gpios and PWM0 for step, PWM1 for buzzer
    motors_sleep();
    stepping_mode(step_mode); //step mode at 32
     
    uart_init();
    
    configure_microphone();

    #if SPARKFUN == 0
      configure_VLX6180();
      #if MB_TEST
        mb_test();
      #endif
    #endif

    // Initialize.
    timers_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    advertising_start();

    #if ADHOC_TEST
      adhoc_robot_test();
    #endif
    #if 0
    //SPARKFUN
      bb_test();
    #endif

    //Show user robot is indeed on and ready
    led_on();                         
    pwm_buzzer_frequency(4000.0, 400);    //higher frequencies are louder with this buzzer          
    while(buzzer_loops_done == 0);
    pwm_buzzer_frequency(5000.0, 400);              
    while(buzzer_loops_done == 0);
    pwm_buzzer_frequency(6000.0, 400);              
    while(buzzer_loops_done == 0);
    led_off();

    recording_flag = 0;
    recording_flag_pi = 0;
    pi_reads_active = 0;
    new_cmd = 0;
    last_cmd = 0;
    motor_state = MOTORS_SLEEP;
    turn_flag = 0;
    for (;;)
    {
          //Trap here when BLE not connected
          callonce = 1;
          while (BLE_Connected == 0)
          {
            if (callonce == 1)
            {
              stop_buzzer();
              stop_stepping_gpio();
              motors_sleep();
              callonce = 0;
            }
            nrf_delay_ms(200);      //BLE not connected robot heartbeat
            led_on();
            nrf_delay_ms(200);
            led_off();
            TxUART(teststr);
          }
          if (recording_flag == 1)
          {
            if (nrf_pdm_event_check(NRF_PDM_EVENT_END) == true)
            {
              led_off();
              recording_flag = 0;
              nrf_drv_pdm_stop();
              //do_dft();             //do fft, then check m_fft_output_f32 64 bytes
              data_value = 255;       //kind of a not good flag
              update_remote_byte();
              ms_cnt = 0;
              i=0;
              while(i<SAMPLE_BUFFER_CNT)    //this is tricky, int16_t == 2 bytes * 10 = 20 bytes
              {
                  //This tough, assume 50Hz or every 20ms. It will take 5s to transfer 32k, if perfect
                  err_code = update_remote_multi_byte(i);
                  if (err_code == NRF_ERROR_RESOURCES || err_code == NRF_ERROR_BUSY)
                  {
                    nrf_delay_ms(2);  //extra delay
                    continue;
                  }
                  else
                  {
                    i+=MULTI_LEN/2;            //only increment is successful (assume)
                  }
                  nrf_delay_ms(19);   //cause slight overrun
                  ++ms_cnt;
                  if (!(ms_cnt % 20))
                    led_off();
                  if (!(ms_cnt % 40))
                    led_on();
               }
               data_value = 127;       //kind of a not good flag
               update_remote_byte();
            }
          }
          if (recording_flag_pi == 1)
          {
            if (nrf_pdm_event_check(NRF_PDM_EVENT_END) == true)
            {
              led_off();
              nrf_drv_pdm_stop();
              load_buffer_offset = 0;
              recording_flag_pi = 0;
              //do_dft();           
              sound_flag.len = 1;                           //sound flag is a 1byte characteristic struct
              data_value = 255;                             //recording done flag, tell Pi to start reading
              sound_flag.p_value = &data_value;
              sound_flag.offset = 0;
              sd_ble_gatts_value_set(m_conn_handle,data_handle.value_handle,&sound_flag); //signal pi to start reading
              pi_reads_active = 1;
            }
          }
          if (pi_reads_active == 1)
          {
              if (load_buffer_offset >= SAMPLE_BUFFER_CNT-1)  //end of 10 uint16_t chunks of buffer
              {
                sound_flag.len = 1;
                data_value = 127;                 //reading done flag, tell Pi
                sound_flag.p_value = &data_value;
                sound_flag.offset = 0;
                sd_ble_gatts_value_set(m_conn_handle,data_handle.value_handle,&sound_flag);
                pi_reads_active = 0;
                load_buffer_offset = 0;
              }
          }
          if (photovore_mode == 1)
          {
              ambient_value = getAmbientLight(GAIN_1);      //indoors LUX is likely 10-1000
              data2_value = (uint16_t)ambient_value;            
              if (data2_value > lux_threshold+4)
              {
                motors_wake();
              }
              else
              {
                motors_sleep();
              }
              update_remote_2byte();
          }
          if (new_cmd == 1)
          {
            if (cmd_value != GET_DISTANCE && cmd_value != GET_AMBIENT)
              led_on();
            photovore_mode = 0;   //any new command cancels mode
            switch(cmd_value)
            {
            case MOTORS_RIGHT:          //go right 30 degrees
              if (motor_state == MOTORS_FORWARD || motor_state == MOTORS_BACKWARD)
              {
                motors_right();
              }
              else
              {
                motors_right();
                motors_wake();
                start_stepping_gpio(freq);     
              }
              break;
            case MOTORS_LEFT:           //go left 30 degrees
              if (motor_state == MOTORS_FORWARD || motor_state == MOTORS_BACKWARD)
              {
                motors_left();
              }
              else
              {
                motors_left();
                motors_wake();
                start_stepping_gpio(freq);     
              }
              break;
            case MOTORS_FORWARD:
              if (motor_state != MOTORS_FORWARD && motor_state != MOTORS_BACKWARD)
              {
                motor_state = MOTORS_FORWARD;
                motors_forward();
                motors_wake();
                start_stepping_gpio(freq);     
              }
              else
              {
                motor_state = MOTORS_FORWARD;
                motors_forward();
              }
              break;
            case MOTORS_BACKWARD:
              if (motor_state != MOTORS_FORWARD && motor_state != MOTORS_BACKWARD)
              {
                motor_state = MOTORS_BACKWARD;
                motors_backward();
                motors_wake();
                start_stepping_gpio(freq);     
              }
              else
              {
                motor_state = MOTORS_BACKWARD;
                motors_backward();
              }
              break;
            case STOP_TURNING:
              switch(motor_state)
              {
                case MOTORS_FORWARD: 
                  motors_forward();
                  break;
                case MOTORS_BACKWARD:
                  motors_backward();
                  break;
                default:
                  break;
              }
              break;
            case MOTORS_STOP:
              motor_state = MOTORS_STOP;
              stop_stepping_gpio();
              motors_sleep();
              break;
            case ROVER_MODE:
              rover(freq,0);
              motor_state = MOTORS_STOP;
              break;
            case ROVER_MODE_REV:
              rover(freq,1);
              motor_state = MOTORS_STOP;
              break;
            case FOTOV_MODE:
              motor_state = MOTORS_STOP;
              photovore_mode = 1;
              motors_forward();
              start_stepping_gpio(freq);
              ambient_value = getAmbientLight(GAIN_1);      //indoors LUX is likely 10-1000
              ambient_value = getAmbientLight(GAIN_1);      
              lux_threshold = (uint16_t)ambient_value;            
              break;
            case MOTORS_SLEEP:
              motor_state = MOTORS_SLEEP;
              motors_sleep();
              break;
            case PLAY_BUZZER:
              if(buzzer_loops_done == 1)
                pwm_buzzer_frequency(4000.0, 1000);              
              break;
            case INC_STEP_MODE:
              motors_sleep();
              ++step_mode;
              if (step_mode == 6)
              {
                step_mode = 0;
              }
              switch(step_mode)
              {
                case FULL_STEP:
                  freq = 100;
                  break;
                case HALF_STEP:
                  freq = 200;
                  break;
                case QUARTER_STEP:
                  freq = 400;
                  break;
                case n8_STEP:
                  freq = 400;
                  break;
                case n16_STEP:
                  freq = 500;  
                  break;
                case n32_STEP:
                  freq = 1000;
                  break;
              }
              stepping_mode(step_mode);
              data_value = step_mode;
              update_remote_byte();
              break;
            case DEC_STEP_MODE:
              motors_sleep();
              if (step_mode != 0)
              {
                --step_mode;
              }
              switch(step_mode)
              {
                case FULL_STEP:
                  freq = 100;
                  break;
                case HALF_STEP:
                  freq = 200;
                  break;
                case QUARTER_STEP:
                  freq = 300;
                  break;
                case n8_STEP:
                  freq = 400;
                  break;
                case n16_STEP:
                  freq = 500;  
                  break;
                case n32_STEP:
                  freq = 1000;
                  break;
              }
              stepping_mode(step_mode);
              data_value = step_mode;
              update_remote_byte();
              break;
            case GET_DISTANCE:
              data_value = getDistance();                   //first set characteristic for host reads
              data_val.len = 1;                             //also send for notification
              data_val.p_value = &data_value;
              data_val.offset = 0;
              sd_ble_gatts_value_set(m_conn_handle,data_handle.value_handle,&data_val);
              update_remote_byte();
              break;
            case GET_AMBIENT:                               //I see Ambient LUX 34-65
              ambient_value = getAmbientLight(GAIN_1);      //if this returns 0, step through and get error code
              ambient_value = getAmbientLight(GAIN_1);      //first values returns 0
              data2_value = (uint16_t)ambient_value;            
              data_val.len = 2;                             //set for host reads, then notify
              data_val.p_value = &data2_value;
              data_val.offset = 0;
              sd_ble_gatts_value_set(m_conn_handle,data_2byte_handle.value_handle,&data_val);
              update_remote_2byte();
              break;
            case RECORD_SOUND:
              data_value = 0;       //using data_value this way is not a good use for a flag
              update_remote_byte();
              m_xfer_done = false;
              for(i=0;(i<SAMPLE_BUFFER_CNT);i++)
                p_rx_buffer[i] = 0;
              nrf_drv_pdm_buffer_set(p_rx_buffer, SAMPLE_BUFFER_CNT);
              nrf_pdm_gain_set(NRF_PDM_GAIN_MAXIMUM,NRF_PDM_GAIN_MAXIMUM);
              nrf_pdm_event_clear(NRF_PDM_EVENT_END);
              led_on();
              nrf_drv_pdm_start();
              recording_flag = 1;
              break;
            case RECORD_SOUND_PI:
              sound_flag.len = 1;
              data_value = 0;                   //tell Pi recording, not ready to read yet
              sound_flag.p_value = &data_value;
              sound_flag.offset = 0;
              sd_ble_gatts_value_set(m_conn_handle,data_handle.value_handle,&sound_flag);
              m_xfer_done = false;
              for(i=0;(i<SAMPLE_BUFFER_CNT);i++)
                p_rx_buffer[i] = 0;
              nrf_drv_pdm_buffer_set(p_rx_buffer, SAMPLE_BUFFER_CNT);
              nrf_pdm_gain_set(NRF_PDM_GAIN_MAXIMUM,NRF_PDM_GAIN_MAXIMUM);
              nrf_pdm_event_clear(NRF_PDM_EVENT_END);
              led_on();
              nrf_drv_pdm_start();
              recording_flag_pi = 1;
              break;
            case INCREASE_GAIN:
              mic_gain += 5;
              if (mic_gain > NRF_PDM_GAIN_MAXIMUM)
                mic_gain = NRF_PDM_GAIN_MAXIMUM;
              nrf_pdm_gain_set(mic_gain,mic_gain);
              data_value = mic_gain;
              update_remote_byte();
              break;
            case DECREASE_GAIN:
              if (mic_gain < NRF_PDM_GAIN_MINIMUM+5)
                  mic_gain = NRF_PDM_GAIN_MINIMUM;
              else
                  mic_gain -= 5;
              nrf_pdm_gain_set(mic_gain,mic_gain);
              data_value = mic_gain;
              update_remote_byte();
              break;
           default:
               break;
          }
          new_cmd = 0;
          last_cmd = cmd_value;
      }
      else
      {
        if (recording_flag == 0 && recording_flag_pi == 0)
        {
          led_off();
        }
        //play_song();
      }
   }  
}

//This is bug specific, please ignore
void adhoc_robot_test(void)
{
    uint8_t val;

    stepping_mode(FULL_STEP);
    motors_backward();
    motors_wake();
    start_stepping_gpio(100);
    val = 0;
    while(1) 
    {
        switch(val)
        {
          case 0:
            led_on();
            motors_forward();
            motors_wake();
            break;
          case 1:
            led_off();
            motors_sleep();
            break;
          case 2:
            led_on();
            motors_backward();
            motors_wake();
            break;
          case 3:
            led_off();
            motors_sleep();
            break;
          default:
            motors_wake();
            stop_stepping_gpio();     //make sure stopped before re-starting
            start_stepping_gpio(100);
            break;
        }
        ++val;


        if (val == 4)
        if (val == 4)
          val = 0;
        nrf_delay_ms(2000);
    }
}

void bb_test(void)
{
    motors_backward();
    motors_wake();
    start_stepping_gpio(100);
    while(1) 
    {
       if (new_cmd == 1)
       {
          switch(cmd_value)
          {
            case MOTORS_FORWARD:
              motors_forward();
              break;
            case MOTORS_BACKWARD:
              motors_backward();
              break;
            case MOTORS_STOP:
              stop_stepping_gpio();
              motors_sleep();
              break;
            default:
              motors_wake();
              stop_stepping_gpio();     //make sure stopped before re-starting
              start_stepping_gpio(100);
              break;
          }
          new_cmd = 0;
      }
      nrf_delay_ms(500);
      led_on();
      nrf_delay_ms(500);
      led_off();
    }
}

//Inherits stepping mode and freq from main()
void rover(uint32_t freq, uint8_t rover_dir)
{
  uint8_t distance;

  if (rover_dir == 0)
    motors_forward();
  else
    motors_backward();
  motors_wake();
  start_stepping_gpio(freq);       
  new_cmd = 0;
  while(new_cmd == 0)
  {
      distance = getDistance();
      if (distance < 50)
      {
        led_on();
        motors_left();
      }
      else
      {
        if (rover_dir == 0)
          motors_forward();
        else
          motors_backward();
        led_off();
      }
      nrf_delay_ms(50);
  }
  stop_stepping_gpio();
  motors_sleep();
  return;
}

//This isn't done
void play_song(void)
{
    static uint8_t i = 0;

    if (buzzer_loops_done == 0)
      return;

    pwm_buzzer_frequency(song.notes[i].freq,song.notes[i].duration);
    if (i == song.num_notes-1)
      i = 0;
    else  
      ++i;
}

//orphaned function, obsolete
void turn_left_90_degrees(void)
{
  motors_left();            //turn left
  motors_wake();
  start_stepping_gpio(50);   
  nrf_delay_ms(100);        //this should be 5 steps each motor for 90 degree turn
  stop_stepping_gpio();          //if it doesn't work I'll try doing 5 steps manually
  motors_sleep();
}

//Left channel mono configured, continuous int16, no alternating right channel
void configure_microphone(void)
{

  nrf_drv_pdm_config_t pdm_config = NRF_DRV_PDM_DEFAULT_CONFIG(MIC_CLK,MIC_DI);

  pdm_config.clock_freq = NRF_PDM_FREQ_1032K;
  pdm_config.mode = NRF_PDM_MODE_MONO;
  pdm_config.edge = NRF_PDM_EDGE_LEFTRISING;
  pdm_config.gain_l = mic_gain;
  pdm_config.gain_r = mic_gain;

