bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
void stop_stepping(void)
{
  if (nrf_pwm_event_check(NRF_PWM0, NRF_PWM_EVENT_LOOPSDONE))
  {
    nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_LOOPSDONE);  
    if (nrf_pwm_event_check(NRF_PWM0, NRF_PWM_EVENT_STOPPED) == 0)
    {
        nrf_pwm_task_trigger(NRF_PWM0, NRF_PWM_TASK_STOP);
        while(nrf_pwm_event_check(NRF_PWM0, NRF_PWM_EVENT_STOPPED) == 0);
        step_loop_done = 1;
    }
  }
}
#endif

void PWM1_IRQHandler(void)
{
    stop_buzzer();
}
//125000/freq=    125000/250
void pwm_buzzer_frequency(float32_t freq, uint32_t loops)
{
  float32_t main_freq;
  volatile static uint16_t pwm_top, pwm_duty[2];
   
  main_freq = 125000.0 / freq;

  pwm_top = (uint16_t)main_freq;
  pwm_duty[0] = pwm_duty[1] = (uint16_t)(main_freq / 2.0);

  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_LOOPSDONE);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_SEQEND0);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_SEQEND1);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_STOPPED);
  nrf_pwm_shorts_set(NRF_PWM1, NRF_PWM_SHORT_LOOPSDONE_SEQSTART0_MASK);
  nrf_pwm_configure(NRF_PWM1,PWM_PRESCALER_PRESCALER_DIV_128,PWM_MODE_UPDOWN_Up,pwm_top);
  nrf_pwm_seq_ptr_set(NRF_PWM1,0,pwm_duty);
  nrf_pwm_seq_cnt_set(NRF_PWM1,0,1);
  nrf_pwm_seq_ptr_set(NRF_PWM1,1,pwm_duty);
  nrf_pwm_seq_cnt_set(NRF_PWM1,1,1);
  nrf_pwm_loop_set(NRF_PWM1,loops / 2);
  nrf_pwm_task_trigger(NRF_PWM1, NRF_PWM_TASK_SEQSTART0);
  buzzer_loops_done = 0;
}

//just toggles gpios for now
void mb_test(void)
{
  static uint8_t range, buf[64];

  nrf_gpio_cfg_output(MIC_CLK);
  nrf_gpio_cfg_output(MIC_DI);
  nrf_gpio_cfg_output(SLEEP);
  
  for(;;)
  {
    led_on();
    nrf_gpio_pin_clear(STEP);
    nrf_gpio_pin_clear(DIR_L);
    nrf_gpio_pin_clear(DIR_R);
    nrf_gpio_pin_clear(M1);
    nrf_gpio_pin_clear(M0);
    nrf_gpio_pin_clear(MIC_CLK);
    nrf_gpio_pin_clear(MIC_DI);
    nrf_gpio_pin_clear(SLEEP);
    nrf_delay_ms(500);
    led_off();
    nrf_gpio_pin_set(STEP);
    nrf_gpio_pin_set(DIR_L);
    nrf_gpio_pin_set(DIR_R);
    nrf_gpio_pin_set(M1);
    nrf_gpio_pin_set(M0);
    nrf_gpio_pin_set(MIC_CLK);
    nrf_gpio_pin_set(MIC_DI);
    nrf_gpio_pin_set(SLEEP);
    nrf_delay_ms(500);
    range = getDistance();
    sprintf(buf,"Range is %d\r\n",range);
    TxUART(buf);

    nrf_delay_ms(500);
  }
}

void stop_buzzer(void)
{
  if (nrf_pwm_event_check(NRF_PWM1, NRF_PWM_EVENT_LOOPSDONE))
  {
    nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_LOOPSDONE);  
    if (nrf_pwm_event_check(NRF_PWM1, NRF_PWM_EVENT_STOPPED) == 0)
    {
        nrf_pwm_task_trigger(NRF_PWM1, NRF_PWM_TASK_STOP);
        while(nrf_pwm_event_check(NRF_PWM1, NRF_PWM_EVENT_STOPPED) == 0);
        buzzer_loops_done = 1;
    }
  }
}

void uart_init(void)
{
  nrf_uarte_baudrate_set(NRF_UARTE0,NRF_UARTE_BAUDRATE_115200); 
  nrf_uarte_txrx_pins_set(NRF_UARTE0,UART_TX_PIN,UART_RX_PIN);
  nrf_uarte_configure(NRF_UARTE0,NRF_UARTE_PARITY_EXCLUDED,NRF_UARTE_HWFC_DISABLED);  //no parity, no hw flow control
  nrf_uarte_rx_buffer_set(NRF_UARTE0,recvbuffer,20);
  nrf_uarte_tx_buffer_set(NRF_UARTE0,sendbuffer,20);
  nrf_uarte_enable(NRF_UARTE0);
}

void my_configure(void)
{
  nrf_gpio_cfg_output(DIR_L);
  nrf_gpio_cfg_output(DIR_R);
  nrf_gpio_cfg_output(SLEEP);
  motors_sleep();               
  motors_forward();
  stepping_mode(HALF_STEP);         

  nrf_gpio_pin_clear(STEP);
  nrf_gpio_cfg_output(STEP);

#if MOTORS_STEPPING_PWM
  NRF_PWM0->PSEL.OUT[0] = STEP;

  nrf_pwm_enable(NRF_PWM0);
  nrf_pwm_configure(NRF_PWM0,PWM_PRESCALER_PRESCALER_DIV_128,PWM_MODE_UPDOWN_Up,1000);
  nrf_pwm_loop_set(NRF_PWM0,0);
  nrf_pwm_decoder_set(NRF_PWM0,PWM_DECODER_LOAD_Common,PWM_DECODER_MODE_RefreshCount);
  nrf_pwm_seq_refresh_set(NRF_PWM0,0,0);
  nrf_pwm_seq_end_delay_set(NRF_PWM0,0,0);
  nrf_pwm_seq_refresh_set(NRF_PWM0,1,0);
  nrf_pwm_seq_end_delay_set(NRF_PWM0,1,0);
  nrf_pwm_shorts_set(NRF_PWM0, 0);
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_LOOPSDONE);
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_SEQEND0);
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_SEQEND1);
  nrf_pwm_event_clear(NRF_PWM0, NRF_PWM_EVENT_STOPPED);
  nrf_pwm_int_set(NRF_PWM0, NRF_PWM_INT_LOOPSDONE_MASK);
  nrf_drv_common_irq_enable(PWM0_IRQn,APP_IRQ_PRIORITY_LOWEST);
#else
  //use gpio STEP and timer1
  nrf_timer_event_clear(NRF_TIMER1,NRF_TIMER_EVENT_COMPARE0);
  nrf_timer_mode_set(NRF_TIMER1,NRF_TIMER_MODE_TIMER);
  nrf_timer_bit_width_set(NRF_TIMER1,NRF_TIMER_BIT_WIDTH_32);
  nrf_timer_frequency_set(NRF_TIMER1,NRF_TIMER_FREQ_125kHz);
  nrf_timer_cc_write(NRF_TIMER1,NRF_TIMER_CC_CHANNEL0,25);        // 200us per interrupt
  nrf_timer_int_enable(NRF_TIMER1,NRF_TIMER_INT_COMPARE0_MASK);
  nrf_drv_common_irq_enable(TIMER1_IRQn,APP_IRQ_PRIORITY_LOWEST);
#endif

  nrf_gpio_pin_clear(BUZZER_10MM);
  nrf_gpio_cfg_output(BUZZER_10MM);
  NRF_PWM1->PSEL.OUT[0] = BUZZER_10MM;

  nrf_pwm_enable(NRF_PWM1);
  nrf_pwm_configure(NRF_PWM1,PWM_PRESCALER_PRESCALER_DIV_128,PWM_MODE_UPDOWN_Up,1000);
  nrf_pwm_loop_set(NRF_PWM1,0);
  nrf_pwm_decoder_set(NRF_PWM1,PWM_DECODER_LOAD_Common,PWM_DECODER_MODE_RefreshCount);
  nrf_pwm_seq_refresh_set(NRF_PWM1,0,0);
  nrf_pwm_seq_end_delay_set(NRF_PWM1,0,0);
  nrf_pwm_seq_refresh_set(NRF_PWM1,1,0);
  nrf_pwm_seq_end_delay_set(NRF_PWM1,1,0);
  nrf_pwm_shorts_set(NRF_PWM1, 0);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_LOOPSDONE);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_SEQEND0);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_SEQEND1);
  nrf_pwm_event_clear(NRF_PWM1, NRF_PWM_EVENT_STOPPED);
  nrf_pwm_int_set(NRF_PWM1, NRF_PWM_INT_LOOPSDONE_MASK);
  nrf_drv_common_irq_enable(PWM1_IRQn,APP_IRQ_PRIORITY_LOWEST);
}

//expects null terminated string, so use sprintf for buf
void TxUART(uint8_t* buf)
{
    uint8_t j;

    j=0;
    while(buf[j] != 0)
    {
        sendbuffer[j] = buf[j];
        ++j;
        if (j > 20)
        {
          j = 20;
          break;
        }
    }
    nrf_uarte_tx_buffer_set(NRF_UARTE0,sendbuffer,j);
    nrf_uarte_event_clear(NRF_UARTE0,NRF_UARTE_EVENT_ENDTX);
    nrf_uarte_task_trigger(NRF_UARTE0,NRF_UARTE_TASK_STARTTX);
    while( nrf_uarte_event_check(NRF_UARTE0,NRF_UARTE_EVENT_ENDTX) == 0);   //This blocks on transmit, maybe fix for parallelism
    nrf_uarte_event_clear(NRF_UARTE0,NRF_UARTE_EVENT_ENDTX);
}

